Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

d = [4, 8, 15, 16, 23, 42]
series = pd.Series(d)

print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
data_prime_list=[1,3,5,7,11,13,17,19,23,29]
series_from_list=pd.Series(data_prime_list)
print(series_from_list)

0     1
1     3
2     5
3     7
4    11
5    13
6    17
7    19
8    23
9    29
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female
Then, print the DataFrame.

In [4]:
data ={"Name":["Alice","Bob","Claire"],
       "Age":[25,30,27],
       "Gender":["Female","Male","Female"]}

In [5]:
df=pd.DataFrame(data)

In [6]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
df[["Name",  "Age", "Gender"]]

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

**ANSWER**:--

1)A DataFrame in pandas is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). 

2)A DataFrame is one of the most widely used data structures in pandas and allows you to store and manipulate data in a flexible and powerful way.

3)a Series in pandas is a one-dimensional array-like object containing a sequence of values (similar to a column in a table), with associated labels (index).

4)**Differences**

1. **Dimensionality:**
   - `Series` is one-dimensional.
   - `DataFrame` is two-dimensional.

2. **Structure:**
   - A `Series` can be thought of as a single column of data.
   - A `DataFrame` is a collection of `Series` that share the same index.

3. **Usage:**
   - `Series` is used for simple, one-dimensional data operations.
   - `DataFrame` is used for more complex data manipulation and analysis.

In [10]:
# Create a Series
series = pd.Series([4, 8, 15, 16, 23, 42], name="Numbers")

print(series)

0     4
1     8
2    15
3    16
4    23
5    42
Name: Numbers, dtype: int64

In [11]:
# Create a DataFrame
data1 = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df1 = pd.DataFrame(data1)

print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4)**Explanation**:

- The `Series` example shows a single column of numbers with an index.
- The `DataFrame` example shows a table with three columns: `Name`, `Age`, and `Gender`. Each column is a `Series`, and together they form the `DataFrame`.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common ones, along with examples of when you might use them:

1. **Head and Tail Functions:**
   - `head(n)`: Returns the first `n` rows of the DataFrame.
   - `tail(n)`: Returns the last `n` rows of the DataFrame.
   - Example: Use `df.head(5)` to quickly view the first 5 rows of your dataset to understand its structure.

2. **Descriptive Statistics:**
   - `describe()`: Generates descriptive statistics that summarize the central tendency, dispersion, and shape of a dataset’s distribution.
   - Example: Use `df.describe()` to get a summary of the numerical columns in your DataFrame.

3. **Indexing and Selecting Data:**
   - `loc[]`: Access a group of rows and columns by labels or a boolean array.
   - `iloc[]`: Access a group of rows and columns by integer position(s).
   - Example: Use `df.loc[df['Age'] > 25]` to select all rows where the `Age` column is greater than 25.

4. **Sorting Data:**
   - `sort_values(by)`: Sorts a DataFrame by the values of one or more columns.
   - Example: Use `df.sort_values(by='Age')` to sort the DataFrame by the `Age` column in ascending order.

5. **Handling Missing Data:**
   - `dropna()`: Removes missing values.
   - `fillna()`: Fills missing values with a specified value.
   - Example: Use `df.fillna(0)` to replace all missing values in the DataFrame with 0.

6. **Data Aggregation and Grouping:**
   - `groupby()`: Groups data by a specified column and performs aggregate functions on other columns.
   - Example: Use `df.groupby('Gender').mean()` to compute the mean of each numeric column grouped by the `Gender` column.

7. **Merging and Joining:**
   - `merge()`: Combines DataFrame objects by columns or indexes.
   - `join()`: Joins columns of another DataFrame.
   - Example: Use `pd.merge(df1, df2, on='key')` to merge two DataFrames `df1` and `df2` on a common column `key`.

**example**

Suppose you have a DataFrame containing sales data and you want to find out the total sales for each product category. You can use the `groupby()` function to achieve this.

In this example, the `groupby()` function is used to group the data by the `Category` column, and the `sum()` function is applied to the `Sales` column to get the total sales for each category. This is useful for summarizing and analyzing sales data by different categories.

In [13]:
data2= {
    'Product': ['A', 'B', 'A', 'C', 'B', 'A'],
    'Category': ['Electronics', 'Furniture', 'Electronics', 'Furniture', 'Furniture', 'Electronics'],
    'Sales': [200, 150, 300, 400, 250, 100]
}

df2 = pd.DataFrame(data2)

In [14]:
df2

  Product     Category  Sales
0       A  Electronics    200
1       B    Furniture    150
2       A  Electronics    300
3       C    Furniture    400
4       B    Furniture    250
5       A  Electronics    100

In [16]:
category_sales = df2.groupby('Category')['Sales'].sum()

print(category_sales)

Category
Electronics    600
Furniture      800
Name: Sales, dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

**ANSWER**:---

Both `Series` and `DataFrame` are mutable in nature in pandas. The `Panel` data structure was used for 3-dimensional data but has been deprecated since pandas version 0.25.0.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
name_series = pd.Series(['Alice', 'Bob', 'Claire'])
age_series = pd.Series([25, 30, 27])
gender_series = pd.Series(['Female', 'Male', 'Female'])

In [18]:
data3 = {
    'Name': name_series,
    'Age': age_series,
    'Gender': gender_series
}

df3 = pd.DataFrame(data3)

In [19]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Explanation**:

Creating Series:

name_series contains names of individuals.
age_series contains ages corresponding to each name.
gender_series contains genders corresponding to each name.


Creating the DataFrame:

A dictionary data is created where keys are column names (Name, Age, Gender) and values are the corresponding Series.
The DataFrame df is created using pd.DataFrame(data).


Output:

The resulting DataFrame has columns Name, Age, and Gender with each Series forming a column in the DataFrame.